package ru.job4j.chess;

public class Board {


    /*5. Создать класс Board. С методом add(Figure figure).

6. В классе создать массив Figure[] figures = new Figure[32] - содержит фигуры. Количество фигур.

7. Добавить метод boolean move(Cell source, Cell dest) throws ImpossibleMoveException, OccupiedWayException, FigureNotFoundException

8. Метод должен проверить
   - Что в заданной ячейки есть фигура. если нет. то выкинуть исключение
   - Если фигура есть. Проверить может ли она так двигаться. Если нет то упадет исключение
   - Проверить что полученный путь. не занят фигурами. Если занят выкинуть исключение
   - Если все отлично. Записать в ячейку новое новое положение Figure figure.copy(Cell dest)

9. Изначально сделайте. только движения фигуры слон и покажите промежуточный результат.*/



}
